138, 139, 142, 143, 144, 145
138.
# m = {
# 'a': '2', 'b': '22', 'c': '222',
# 'd': '3', 'e': '33', 'f': '333',
# 'g': '4', 'h': '44', 'i': '444',
# 'j': '5', 'k': '55', 'l': '555',
# 'm': '6', 'n': '66', 'o': '666',
# 'p': '7', 'q': '77', 'r': '777', 's': '7777',
# 't': '8', 'u': '88', 'v': '888',
# 'w': '9', 'x': '99', 'y': '999', 'z': '9999',
# ' ': '0'}
# text = input("Введите текст: ")
# text = text.lower()
# b = ''
# for i in text:
#     if i in m:
#         b += m[i]
# print(f"Последовательность кнопок для введенного текста: {b}")
139.
# m = {
# 'a': '.- ', 'b': '-... ', 'c': '-.-. ',
# 'd': '-.. ', 'e': '. ', 'f': '..-. ',
# 'g': '--. ', 'h': '... . ', 'i': '.. ',
# 'j': '.--- ', 'k': '-.- ', 'l': '.-.. ',
# 'm': '-- ', 'n': '-. ', 'o': '--- ',
# 'p': '.--. ', 'q': '--.- ', 'r': '.-. ', 's': '... ',
# 't': '- ', 'u': '..- ', 'v': '...- ',
# 'w': '.-- ', 'x': '-..- ', 'y': '-.-- ', 'z': '--.. ',
# 'o': '----- ',}
# text = input("Введите текст: ")
# text = text.lower()
# b = ''
# for i in text:
#     if i in m:
#         b += m[i]
# print(f"Последовательность кнопок для введенного текста: {b}")
142.
# newlist = (0)
# text = input("Введите текст: ")
# for i in range(0, len(text)):
#     if text[i] == 1:
#         newlist += 1
#     else:
#         newlist += 1
# print(newlist)
for i in range(10):
    print(i)